public_html/papers/20240617-hires-seismic.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-10-23 Thu 13:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>High-Resolution Detection of Earth Structural Heterogeneities from Seismic Amplitudes using Convolutional Neural Networks with Attention layers</title>
<meta name="author" content="Guilherme Schardong" />
<meta name="generator" content="Org Mode" />
<meta name="referrer" content="origin" />
<link rel="stylesheet" href="../css/tufte.css" type="text/css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">High-Resolution Detection of Earth Structural Heterogeneities from Seismic Amplitudes using Convolutional Neural Networks with Attention layers</h1>

<div id="outline-container-orgeed6bd2" class="outline-2">
<h2 id="orgeed6bd2">Abstract</h2>
<div class="outline-text-2" id="text-orgeed6bd2">
<p>
Earth structural heterogeneities have a remarkable role in the petroleum economy for both exploration and production projects. Automatic detection of detailed structural heterogeneities is challenging when considering modern machine learning techniques like deep neural networks. Typically these techniques can be an excellent tool for assisted interpretation of such heterogeneities but it heavily depends on the amount of data to be trained. We propose an efficient and cost-effective architecture for detecting seismic structural heterogeneities using Convolutional Neural Networks (CNNs) combined with Attention layers. The attention mechanism reduces costs and enhances accuracy even in cases with relatively noisy data. Our model has half the parameters compared to the state-of-the-art and it outperforms previous methods in terms of Intersection over Union (IoU) by 0.6% and precision by 0.4%. By leveraging synthetic data we apply transfer learning to train and fine-tune the model addressing the challenge of limited annotated data availability.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Guilherme Schardong</p>
<p class="date">Created: 2025-10-23 Thu 13:47</p>
</div>
</body>
</html>
